archive/before-2018-11-10/2018-04-12-折腾字节序.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2018-04-12-折腾字节序</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2018-04-12-折腾字节序</h1>
<p>
字节序只是在内存中存取的时候才需要考虑的。
</p>

<p>
<b>在C代码里面使用位操作这些，可以不考虑字节序。</b>
</p>

<p>
printf直接用 <code>%x</code> 打印32位的数是看不出来大小端的<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
只能用指针一个字节一个字节打印才看得出来<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>。
</p>

<p>
一次读写超过一个字节的内容时，可能就需要考虑字节序了。
</p>

<p>
阮一峰老师的文章讲得浅显易懂 <a href="http://www.ruanyifeng.com/blog/2016/11/byte-order.html">理解字节序</a> 。
</p>

<p>
然后他还推荐了这篇文章： <a href="https://blog.erratasec.com/2016/11/how-to-teach-endian.html#.Ws6-ida-v3U">How to teach endian</a> 。
</p>

<p>
我当前主要是涉及到ip地址的问题：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;string.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdint.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;arpa/inet.h&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">args</span>,<span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">in_addr</span>  <span style="color: #ff8700;">big_endian_ip</span>;
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">in_addr</span>  <span style="color: #ff8700;">little_endian_ip</span>;
    <span style="color: #00d7af;">uint8_t</span> *<span style="color: #ff8700;">p</span>;
    inet_aton(<span style="color: #ff4ea3;">"1.2.3.4"</span>, &amp;big_endian_ip);
    little_endian_ip.s_addr = ntohl(big_endian_ip.s_addr);

    printf(<span style="color: #ff4ea3;">"&#21482;&#26377;&#36890;&#36807;&#25351;&#38024;p&#25165;&#30475;&#24471;&#20986;&#26469;&#22823;&#23567;&#31471;&#65292;x86&#26159;&#23567;&#31471;&#30340;&#26426;&#22120;&#65292;&#22312;x86&#19978;&#20197;1.2.3.4&#20026;&#20363;&#65306;\n"</span>);
    printf(<span style="color: #ff4ea3;">"\n==========================================\n"</span>);

    p = (<span style="color: #00d7af;">uint8_t</span> *)&amp;big_endian_ip;
    printf(<span style="color: #ff4ea3;">"hex_dump_big_endian_ip 0x%x\n"</span>, big_endian_ip.s_addr);
    printf(<span style="color: #ff4ea3;">"\n==========================================\n"</span>);
    printf(<span style="color: #ff4ea3;">"big_endian==&gt;p[0] %d\n"</span>, p[0]);
    printf(<span style="color: #ff4ea3;">"big_endian==&gt;p[1] %d\n"</span>, p[1]);
    printf(<span style="color: #ff4ea3;">"big_endian==&gt;p[2] %d\n"</span>, p[2]);
    printf(<span style="color: #ff4ea3;">"big_endian==&gt;p[3] %d\n"</span>, p[3]);
    printf(<span style="color: #ff4ea3;">"\n==========================================\n"</span>);

    printf(<span style="color: #ff4ea3;">"big_endian_ip&gt;&gt;24 %d\n"</span>, big_endian_ip.s_addr &gt;&gt; 24 &amp; 0xFF);
    printf(<span style="color: #ff4ea3;">"big_endian_ip&gt;&gt;16  %d\n"</span>, big_endian_ip.s_addr &gt;&gt; 16 &amp; 0xFF);
    printf(<span style="color: #ff4ea3;">"big_endian_ip&gt;&gt;8 %d\n"</span>, big_endian_ip.s_addr &gt;&gt; 8 &amp; 0xFF);
    printf(<span style="color: #ff4ea3;">"big_endian_ip&gt;&gt;0 %d\n"</span>, big_endian_ip.s_addr &amp; 0xFF);

    
    p = (<span style="color: #00d7af;">uint8_t</span> *)&amp;little_endian_ip;
    printf(<span style="color: #ff4ea3;">"\n==========================================\n"</span>);
    printf(<span style="color: #ff4ea3;">"hex_dump_little_endian_ip 0x%x\n"</span>, little_endian_ip.s_addr);
    printf(<span style="color: #ff4ea3;">"\n==========================================\n"</span>);

    printf(<span style="color: #ff4ea3;">"little_endian==&gt;p[0] %d\n"</span>, p[0]);
    printf(<span style="color: #ff4ea3;">"little_endian==&gt;p[1] %d\n"</span>, p[1]);
    printf(<span style="color: #ff4ea3;">"little_endian==&gt;p[2] %d\n"</span>, p[2]);
    printf(<span style="color: #ff4ea3;">"little_endian==&gt;p[3] %d\n"</span>, p[3]);
    printf(<span style="color: #ff4ea3;">"\n==========================================\n"</span>);

    printf(<span style="color: #ff4ea3;">"little_endian_ip&gt;&gt;24 %d\n"</span>, little_endian_ip.s_addr &gt;&gt; 24 &amp; 0xFF);
    printf(<span style="color: #ff4ea3;">"little_endian_ip&gt;&gt;16 %d\n"</span>, little_endian_ip.s_addr &gt;&gt; 16 &amp; 0xFF);
    printf(<span style="color: #ff4ea3;">"little_endian_ip&gt;&gt;8 %d\n"</span>, little_endian_ip.s_addr &gt;&gt; 8 &amp; 0xFF);
    printf(<span style="color: #ff4ea3;">"little_endian_ip&gt;&gt;0 %d\n"</span>, little_endian_ip.s_addr &amp; 0xFF);

    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">只有通过指针p才看得出来大小端，x86是小端的机器，在x86上以1.2.3.4为例：</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>========================================</code></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">hex_dump_big_endian_ip</td>
<td class="org-right">0x4030201</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>========================================</code></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">big_endian==&gt;p[0]</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">big_endian==&gt;p[1]</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">big_endian==&gt;p[2]</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">big_endian==&gt;p[3]</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>========================================</code></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">big_endian_ip&gt;&gt;24</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">big_endian_ip&gt;&gt;16</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">big_endian_ip&gt;&gt;8</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">big_endian_ip&gt;&gt;0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>========================================</code></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">hex_dump_little_endian_ip</td>
<td class="org-right">0x1020304</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>========================================</code></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">little_endian==&gt;p[0]</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">little_endian==&gt;p[1]</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">little_endian==&gt;p[2]</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">little_endian==&gt;p[3]</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>========================================</code></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">little_endian_ip&gt;&gt;24</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">little_endian_ip&gt;&gt;16</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">little_endian_ip&gt;&gt;8</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">little_endian_ip&gt;&gt;0</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>

<p>
<b>inet_aton这个函数转出来是大端</b> 。
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;string.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdint.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;arpa/inet.h&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">args</span>,<span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">a</span> = 0x01020304;
    <span style="color: #00d7af;">uint8_t</span> *<span style="color: #ff8700;">p</span> = (<span style="color: #00d7af;">uint8_t</span> *)&amp;a;

    printf(<span style="color: #ff4ea3;">"hex_dump %x\n"</span>, a);
    printf(<span style="color: #ff4ea3;">"p[0] %d\n"</span>, p[0]);
    printf(<span style="color: #ff4ea3;">"p[1] %d\n"</span>, p[1]);
    printf(<span style="color: #ff4ea3;">"p[2] %d\n"</span>, p[2]);
    printf(<span style="color: #ff4ea3;">"p[3] %d\n"</span>, p[3]);
    printf(<span style="color: #ff4ea3;">"\n================\n"</span>);
    printf(<span style="color: #ff4ea3;">"a&gt;&gt;24 %d\n"</span>, a &gt;&gt; 24 &amp; 0XFF);
    printf(<span style="color: #ff4ea3;">"a&gt;&gt;16 %d\n"</span>, a &gt;&gt; 16 &amp; 0XFF);
    printf(<span style="color: #ff4ea3;">"a&gt;&gt;8  %d\n"</span>, a &gt;&gt; 8  &amp; 0XFF);
    printf(<span style="color: #ff4ea3;">"a&gt;&gt;0 %d\n"</span>, a &amp; 0XFF);


    printf(<span style="color: #ff4ea3;">"\n================\n"</span>);
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">in_addr</span> <span style="color: #ff8700;">ip</span>;
    inet_aton(<span style="color: #ff4ea3;">"224.2.3.4"</span>, &amp;ip);

    p = (<span style="color: #00d7af;">uint8_t</span> *)&amp;ip.s_addr;
    printf(<span style="color: #ff4ea3;">"hex_dump %x\n"</span>, ip.s_addr);
    printf(<span style="color: #ff4ea3;">"p[0] = %d\n"</span>, p[0]);
    printf(<span style="color: #ff4ea3;">"p[1] = %d\n"</span>, p[1]);
    printf(<span style="color: #ff4ea3;">"p[2] = %d\n"</span>, p[2]);
    printf(<span style="color: #ff4ea3;">"p[3] = %d\n"</span>, p[3]);
    printf(<span style="color: #ff4ea3;">"\n================\n"</span>);
    printf(<span style="color: #ff4ea3;">"ip&gt;&gt;24 = %d\n"</span>, ip.s_addr &gt;&gt; 24 &amp; 0xFF);
    printf(<span style="color: #ff4ea3;">"ip&gt;&gt;16 = %d\n"</span>, ip.s_addr &gt;&gt; 16 &amp; 0xFF);
    printf(<span style="color: #ff4ea3;">"ip&gt;&gt;8  = %d\n"</span>, ip.s_addr &gt;&gt; 8  &amp; 0xFF);
    printf(<span style="color: #ff4ea3;">"ip&gt;&gt;0 = %d\n"</span>, ip.s_addr &amp; 0xFF);


    ip.s_addr = ntohl(ip.s_addr);
    printf(<span style="color: #ff4ea3;">"prefix = %d\n"</span>, ip.s_addr &gt;&gt; 28);

    
    <span style="color: #a1db00;">return</span> 0;
}

</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">hex_dump</td>
<td class="org-right">1020304</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">p[0]</td>
<td class="org-right">4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">p[1]</td>
<td class="org-right">3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">p[2]</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">p[3]</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>==============</code></td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">a&gt;&gt;24</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">a&gt;&gt;16</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">a&gt;&gt;8</td>
<td class="org-right">3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">a&gt;&gt;0</td>
<td class="org-right">4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>==============</code></td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">hex_dump</td>
<td class="org-right">40302e0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">p[0]</td>
<td class="org-right">=</td>
<td class="org-left">224</td>
</tr>

<tr>
<td class="org-left">p[1]</td>
<td class="org-right">=</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">p[2]</td>
<td class="org-right">=</td>
<td class="org-left">3</td>
</tr>

<tr>
<td class="org-left">p[3]</td>
<td class="org-right">=</td>
<td class="org-left">4</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>==============</code></td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ip&gt;&gt;24</td>
<td class="org-right">=</td>
<td class="org-left">4</td>
</tr>

<tr>
<td class="org-left">ip&gt;&gt;16</td>
<td class="org-right">=</td>
<td class="org-left">3</td>
</tr>

<tr>
<td class="org-left">ip&gt;&gt;8</td>
<td class="org-right">=</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">ip&gt;&gt;0</td>
<td class="org-right">=</td>
<td class="org-left">224</td>
</tr>

<tr>
<td class="org-left">prefix</td>
<td class="org-right">=</td>
<td class="org-left">14</td>
</tr>
</tbody>
</table>

<p>
<b>inet_pton这个函数转出来是大端</b> 。
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;string.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;arpa/inet.h&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">args</span>,<span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">b</span>;
    <span style="color: #00d7af;">uint8_t</span> * <span style="color: #ff8700;">p</span>;

    inet_pton(AF_INET, <span style="color: #ff4ea3;">"192.168.31.1"</span>, &amp;b);
    p = (<span style="color: #00d7af;">uint8_t</span> *)&amp;b;
    printf(<span style="color: #ff4ea3;">"hex_dump %x\n"</span>, b);
    printf(<span style="color: #ff4ea3;">"p[0] %d\n"</span>, p[0]);
    printf(<span style="color: #ff4ea3;">"p[1] %d\n"</span>, p[1]);
    printf(<span style="color: #ff4ea3;">"p[2] %d\n"</span>, p[2]);
    printf(<span style="color: #ff4ea3;">"p[3] %d\n"</span>, p[3]);

    <span style="color: #a1db00;">return</span> 0;
}

</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">hex_dump</td>
<td class="org-right">11fa8c0</td>
</tr>

<tr>
<td class="org-left">p[0]</td>
<td class="org-right">192</td>
</tr>

<tr>
<td class="org-left">p[1]</td>
<td class="org-right">168</td>
</tr>

<tr>
<td class="org-left">p[2]</td>
<td class="org-right">31</td>
</tr>

<tr>
<td class="org-left">p[3]</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">我理解：处理器知
道自己的字节序，它在从内存读写这个32位数时，是已经考虑了字节序的。</div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara">因为这时候一个字节一个字
节访问，才真正可以体现出数据在内存中的存储情况。</div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>